## Exercise - Explore data with NumPy and Pandas

### Exploring Data with Python

A significant part of a a data scientist's role is to explore, analyze, and visualize data. [Bir veri bilimcisinin rolünün önemli bir kısmı, verileri keşfetmek, analiz etmek ve görselleştirmektir.] There's a wide range of tools and programming languages that they can use to do this; and of the most popular approaches is to use Jupyter notebooks (like this one) and Python. [Bunu yapmak için kullanabilecekleri çok çeşitli araçlar ve programlama dilleri vardır; ve en popüler yaklaşımlardan biri Jupyter not defterlerini (bunun gibi) ve Python'u kullanmaktır.]

Python is a flexible programming language that is used in a wide range of scenarios; from web applications to device programming. [Python, çok çeşitli senaryolarda kullanılan esnek bir programlama dilidir; web uygulamalarından cihaz programlamaya kadar.] It's extremely popular in the data science and machine learning community because of the many packages it supports for data analysis and visualization. [Veri analizi ve görselleştirme için desteklediği birçok paket nedeniyle veri bilimi ve makine öğrenimi topluluğunda son derece popülerdir.]

In this notebook, we'll explore some of these packages, and apply basic techniques to analyze data. [Bu not defterinde, bu paketlerden bazılarını inceleyeceğiz ve verileri analiz etmek için temel teknikleri uygulayacağız.] This is not intended to be a comprehensive Python programming exercise; or even a deep dive into data analysis. [Bunun kapsamlı bir Python programlama alıştırması olması amaçlanmamıştır; hatta veri analizine derin bir dalış.] Rather, it's intended as a crash course in some of the common ways in which data scientists can use Python to work with data. [Bunun yerine, veri bilimcilerinin verilerle çalışmak için Python'u kullanabileceği bazı yaygın yöntemlerde hızlandırılmış bir kurs olarak tasarlanmıştır.]

**Note**: If you've never used the Jupyter Notebooks environment before, there are a few things you should be aware of: [Not: Jupyter Notebooks ortamını daha önce hiç kullanmadıysanız, bilmeniz gereken birkaç şey vardır:]

- Notebooks are made up of cells. [Defterler hücrelerden oluşur.] Some cells (like this one) contain markdown text, while others (like the one beneath this one) contain code. [Bazı hücreler (bunun gibi) işaretleme metni içerirken, diğerleri (bunun altındaki gibi) kod içerir.]

- You can run each code cell by using the ► Run button. the ► Run button will show up when you hover over the cell. [► Çalıştır düğmesini kullanarak her bir kod hücresini çalıştırabilirsiniz. ► Çalıştır düğmesi, hücrenin üzerine geldiğinizde görünecektir.]

- The output from each code cell will be displayed immediately below the cell. [Her bir kod hücresinin çıktısı, hücrenin hemen altında görüntülenecektir.]

- Even though the code cells can be run individually, some variables used in the code are global to the notebook. [Kod hücreleri ayrı ayrı çalıştırılabilse de, kodda kullanılan bazı değişkenler not defteri için geneldir.] That means that you should run all of the code cells in order. [Bu, tüm kod hücrelerini sırayla çalıştırmanız gerektiği anlamına gelir.] There may be dependencies between code cells, so if you skip a cell, subsequent cells might not run correctly. [Kod hücreleri arasında bağımlılıklar olabilir, bu nedenle bir hücreyi atlarsanız sonraki hücreler düzgün çalışmayabilir.]

**Exploring data arrays with NumPy [NumPy ile veri dizilerini keşfetme]**

Lets start by looking at some simple data. [Bazı basit verilere bakarak başlayalım.]

Suppose a college takes a sample of student grades for a data science class. [Bir üniversitenin bir veri bilimi dersi için öğrenci notlarından bir örnek aldığını varsayalım.]

Run the code in the cell below by clicking the ► Run button to see the data. [Verileri görmek için ► Çalıştır düğmesine tıklayarak aşağıdaki hücredeki kodu çalıştırın.]

In [1]:
data = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]
print(data)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

The data has been loaded into a Python list structure, which is a good data type for general data manipulation, but not optimized for numeric analysis. For that, we're going to use the NumPy package, which includes specific data types and functions for working with Numbers in Python.

Run the cell below to load the data into a NumPy array.

In [2]:
import numpy as np

grades = np.array(data)
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

Just in case you're wondering about the differences between a list and a NumPy array, let's compare how these data types behave when we use them in an expression that multiplies them by 2. [Bir liste ve bir NumPy dizisi arasındaki farkları merak ediyorsanız, onları 2 ile çarpan bir ifadede kullandığımızda bu veri türlerinin nasıl davrandığını karşılaştıralım.]

In [3]:
print (type(data),'x 2:', data * 2)
print('---')
print (type(grades),'x 2:', grades * 2)

<class 'list'> x 2: [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
---
<class 'numpy.ndarray'> x 2: [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

Note that multiplying a list by 2 creates a new list of twice the length with the original sequence of list elements repeated. [Bir listeyi 2 ile çarpmanın, orijinal liste öğeleri dizisinin tekrarlandığı iki katı uzunlukta yeni bir liste oluşturduğunu unutmayın.] Multiplying a NumPy array on the other hand performs an element-wise calculation in which the array behaves like a vector, so we end up with an array of the same size in which each element has been multiplied by 2. [Öte yandan bir NumPy dizisinin çarpılması, dizinin bir vektör gibi davrandığı öğe bazında bir hesaplama gerçekleştirir, bu nedenle, her bir öğenin 2 ile çarpıldığı aynı boyutta bir dizi ile sonuçlanırız.]

The key takeaway from this is that NumPy arrays are specifically designed to support mathematical operations on numeric data - which makes them more useful for data analysis than a generic list. [NumPy dizilerinin sayısal veriler üzerindeki matematiksel işlemleri desteklemek için özel olarak tasarlanmış olması, bu dizilerin veri analizi için genel bir listeden daha kullanışlı olmasını sağlar.]

You might have spotted that the class type for the numpy array above is a numpy.ndarray. [Yukarıdaki numpy dizisinin sınıf türünün bir numpy.ndarray olduğunu fark etmiş olabilirsiniz.] The nd indicates that this is a structure that can consists of multiple dimensions (it can have n dimensions). [nd, bunun birden çok boyuttan oluşabilen bir yapı olduğunu gösterir (n boyuta sahip olabilir).] Our specific instance has a single dimension of student grades. [Özel örneğimiz, öğrenci notlarının tek bir boyutuna sahiptir.]

Run the cell below to view the shape of the array. [Dizinin şeklini görüntülemek için aşağıdaki hücreyi çalıştırın.]

In [4]:
grades.shape

(22,)

The shape confirms that this array has only one dimension, which contains 22 elements (there are 22 grades in the original list). [Şekil, bu dizinin 22 eleman içeren tek bir boyutu olduğunu doğrular (orijinal listede 22 sınıf vardır).] You can access the individual elements in the array by their zero-based ordinal position. [Dizideki tek tek öğelere, sıfır tabanlı sıra konumlarına göre erişebilirsiniz.] Let's get the first element (the one in position 0). [İlk elemanı alalım (0 konumunda olan).]

In [5]:
grades[0]

50

Alright, now you know your way around a NumPy array, it's time to perform some analysis of the grades data. [Pekala, artık bir NumPy dizisinde yolunuzu biliyorsunuz, not verilerinin bazı analizlerini gerçekleştirmenin zamanı geldi.]

You can apply aggregations across the elements in the array, so let's find the simple average grade (in other words, the mean grade value). [Toplamaları dizideki öğelere uygulayabilirsiniz, bu nedenle basit ortalama notu (başka bir deyişle ortalama not değerini) bulalım.]

In [6]:
grades.mean()

49.18181818181818

So the mean grade is just around 50 - more or less in the middle of the possible range from 0 to 100. [Yani ortalama not yaklaşık 50'dir - aşağı yukarı 0 ile 100 arasındaki olası aralığın ortasında.]
                                                                                                       
Let's add a second set of data for the same students, this time recording the typical number of hours per week they devoted to studying. [Aynı öğrenciler için ikinci bir veri seti ekleyelim, bu sefer haftada ders çalışmaya ayırdıkları tipik saat sayısını kaydedelim.]

In [7]:
# Define an array of study hours
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]

# Create a 2D array (an array of arrays)
student_data = np.array([study_hours, grades])

# display the array
student_data

array([[10.  , 11.5 ,  9.  , 16.  ,  9.25,  1.  , 11.5 ,  9.  ,  8.5 ,
        14.5 , 15.5 , 13.75,  9.  ,  8.  , 15.5 ,  8.  ,  9.  ,  6.  ,
        10.  , 12.  , 12.5 , 12.  ],
       [50.  , 50.  , 47.  , 97.  , 49.  ,  3.  , 53.  , 42.  , 26.  ,
        74.  , 82.  , 62.  , 37.  , 15.  , 70.  , 27.  , 36.  , 35.  ,
        48.  , 52.  , 63.  , 64.  ]])

Now the data consists of a 2-dimensional array - an array of arrays. [Şimdi veriler 2 boyutlu bir diziden oluşuyor - bir dizi dizi.] Let's look at its shape. [Şekline bakalım.]

In [8]:
# Show shape of 2D array
student_data.shape

(2, 22)

The student_data array contains two elements, each of which is an array containing 22 elements. [Student_data dizisi, her biri 22 eleman içeren bir dizi olan iki eleman içerir.]

To navigate this structure, you need to specify the position of each element in the hierarchy. [Bu yapıda gezinmek için hiyerarşideki her öğenin konumunu belirtmeniz gerekir.] So to find the first value in the first array (which contains the study hours data), you can use the following code. [Yani (çalışma saatleri verilerini içeren) ilk dizideki ilk değeri bulmak için aşağıdaki kodu kullanabilirsiniz.]

In [9]:
# Show the first element of the first element
student_data[0][0]

10.0

In [ ]:
Now you have a multidimensional array containing both the student's study time and grade information, which you can use to compare data. [Artık, verileri karşılaştırmak için kullanabileceğiniz hem öğrencinin çalışma süresini hem de not bilgilerini içeren çok boyutlu bir diziniz var.] For example, how does the mean study time compare to the mean grade? [Örneğin, ortalama çalışma süresi ortalama notla nasıl karşılaştırılır?]

In [10]:
# Get the mean value of each sub-array
avg_study = student_data[0].mean()
avg_grade = student_data[1].mean()

print('Average study hours: {:.2f}\nAverage grade: {:.2f}'.format(avg_study, avg_grade))

Average study hours: 10.52
Average grade: 49.18

### Exploring tabular data with Pandas

While NumPy provides a lot of the functionality you need to work with numbers, and specifically arrays of numeric values; when you start to deal with two-dimensional tables of data, the Pandas package offers a more convenient structure to work with - the DataFrame. [NumPy, sayılarla ve özellikle sayısal değer dizileriyle çalışmak için ihtiyaç duyduğunuz birçok işlevi sağlarken; iki boyutlu veri tablolarıyla uğraşmaya başladığınızda, Pandas paketi çalışmak için daha uygun bir yapı sunar - DataFrame.]

Run the following cell to import the Pandas library and create a DataFrame with three columns. [Pandalar kitaplığını içe aktarmak için aşağıdaki hücreyi çalıştırın ve üç sütunlu bir DataFrame oluşturun.] The first column is a list of student names, and the second and third columns are the NumPy arrays containing the study time and grade data. [İlk sütun, öğrenci adlarının bir listesidir ve ikinci ve üçüncü sütunlar, çalışma süresi ve not verilerini içeren NumPy dizileridir.]

In [11]:
import pandas as pd

df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':student_data[0],
                            'Grade':student_data[1]})

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Note that in addition to the columns you specified, the DataFrame includes an index to unique identify each row. [Belirttiğiniz sütunlara ek olarak DataFrame'in her satırı benzersiz şekilde tanımlayan bir dizin içerdiğini unutmayın.] We could have specified the index explicitly, and assigned any kind of appropriate value (for example, an email address); but because we didn't specify an index, one has been created with a unique integer value for each row. [Dizini açıkça belirtebilir ve her türlü uygun değeri atayabilirdik (örneğin, bir e-posta adresi); ancak bir dizin belirtmediğimiz için, her satır için benzersiz bir tamsayı değeriyle bir dizin oluşturuldu.]

### Finding and filtering data in a DataFrame [DataFrame'de veri bulma ve filtreleme]
                                           
You can use the DataFrame's loc method to retrieve data for a specific index value, like this. [Bunun gibi belirli bir dizin değeri için veri almak için DataFrame'in loc yöntemini kullanabilirsiniz.]

In [12]:
# Get the data for index value 5
df_students.loc[5]

Name          Vicky
StudyHours      1.0
Grade           3.0
Name: 5, dtype: object

You can also get the data at a range of index values, like this: [Verileri aşağıdaki gibi bir dizi indeks değerinde de alabilirsiniz:]

In [13]:
# Get the rows with index values from 0 to 5
df_students.loc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

In addition to being able to use the loc method to find rows based on the index, you can use the iloc method to find rows based on their ordinal position in the DataFrame (regardless of the index): [Dizine dayalı satırları bulmak için loc yöntemini kullanabilmenin yanı sıra, DataFrame'deki sıralı konumlarına göre satırları bulmak için iloc yöntemini kullanabilirsiniz (dizinden bağımsız olarak):]

In [14]:
# Get data in the first five rows
df_students.iloc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

Look carefully at the iloc[0:5] results, and compare them to the loc[0:5] results you obtained previously. [iloc[0:5] sonuçlarına dikkatlice bakın ve bunları daha önce elde ettiğiniz loc[0:5] sonuçlarıyla karşılaştırın.] Can you spot the difference? [Farkı görebiliyor musunuz?]

The loc method returned rows with index label in the list of values from 0 to 5 - which includes 0, 1, 2, 3, 4, and 5 (six rows). [loc yöntemi, 0, 1, 2, 3, 4 ve 5'i (altı satır) içeren 0 ile 5 arasındaki değerler listesinde dizin etiketli satırlar döndürdü.] However, the iloc method returns the rows in the positions included in the range 0 to 5, and since integer ranges don't include the upper-bound value, this includes positions 0, 1, 2, 3, and 4 (five rows). [Bununla birlikte, iloc yöntemi 0 ila 5 aralığındaki konumlardaki satırları döndürür ve tamsayı aralıkları üst sınır değeri içermediğinden, buna 0, 1, 2, 3 ve 4 (beş satır) konumları dahildir. .]
                                                                                                                                   
iloc identifies data values in a DataFrame by position, which extends beyond rows to columns. [iloc, bir DataFrame'deki veri değerlerini, satırların ötesinde sütunlara uzanan konuma göre tanımlar.] So for example, you can use it to find the values for the columns in positions 1 and 2 in row 0, like this: [Örneğin, 0 satırında 1 ve 2 numaralı konumlardaki sütunların değerlerini bulmak için şunu kullanabilirsiniz:]

In [16]:
df_students.iloc[0,[1,2]]

StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

Let's return to the loc method, and see how it works with columns. [loc yöntemine dönelim ve sütunlarla nasıl çalıştığını görelim.] Remember that loc is used to locate data items based on index values rather than positions. [Konum yerine dizin değerlerine dayalı olarak veri öğelerini bulmak için loc'un kullanıldığını unutmayın.] In the absence of an explicit index column, the rows in our dataframe are indexed as integer values, but the columns are identified by name: [Açık bir dizin sütununun yokluğunda, veri çerçevemizdeki satırlar tamsayı değerleri olarak dizine eklenir, ancak sütunlar adlarıyla tanımlanır:]

In [17]:
df_students.loc[0,'Grade']

50.0

Here's another useful trick. [İşte başka bir faydalı numara.] You can use the loc method to find indexed rows based on a filtering expression that references named columns other than the index, like this: [Dizin dışında adlandırılmış sütunlara başvuran bir filtreleme ifadesine dayalı dizine alınmış satırları bulmak için loc yöntemini kullanabilirsiniz, şöyle:]

In [19]:
df_students.loc[df_students['Name']=='Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

Actually, you don't need to explicitly use the loc method to do this - you can simply apply a DataFrame filtering expression, like this: [Aslında, bunu yapmak için loc yöntemini açıkça kullanmanıza gerek yoktur - basitçe şöyle bir DataFrame filtreleme ifadesi uygulayabilirsiniz:]

In [21]:
df_students[df_students['Name']=='Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

And for good measure, you can achieve the same results by using the DataFrame's query method, like this: [Ve iyi bir ölçüm için, DataFrame'in sorgulama yöntemini kullanarak aynı sonuçları elde edebilirsiniz, bunun gibi:]

In [22]:
df_students.query('Name=="Aisha"')

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

The three previous examples underline an occassionally confusing truth about working with Pandas. [Önceki üç örnek, Pandalarla çalışma konusunda zaman zaman kafa karıştıran bir gerçeğin altını çiziyor.] Often, there are multiple ways to achieve the same results. [Çoğu zaman, aynı sonuçlara ulaşmanın birden fazla yolu vardır.] Another example of this is the way you refer to a DataFrame column name. [Buna başka bir örnek, DataFrame sütun adına başvurma şeklinizdir.] You can specify the column name as a named index value (as in the df_students['Name'] examples we've seen so far), or you can use the column as a property of the DataFrame, like this: [Sütun adını adlandırılmış bir dizin değeri olarak belirtebilirsiniz (şu ana kadar gördüğümüz df_students['Name'] örneklerinde olduğu gibi) veya sütunu aşağıdaki gibi DataFrame'in bir özelliği olarak kullanabilirsiniz:]

In [23]:
df_students[df_students.Name == 'Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

### Loading a DataFrame from a file

We constructed the DataFrame from some existing arrays. [DataFrame'i mevcut bazı dizilerden oluşturduk.] However, in many real-world scenarios, data is loaded from sources such as files. [Ancak, birçok gerçek dünya senaryosunda veriler, dosyalar gibi kaynaklardan yüklenir.] Let's replace the student grades DataFrame with the contents of a text file. [DataFrame'in öğrenci notlarını bir metin dosyasının içeriğiyle değiştirelim.]

In [25]:
! pip install wget

Collecting wget
  Downloading wget-3.2.zip (10 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: wget
  Building wheel for wget (setup.py): started
  Building wheel for wget (setup.py): finished with status 'done'
  Created wheel for wget: filename=wget-3.2-py3-none-any.whl size=9672 sha256=23b01b4683660a7d6cfcf3b1ba184912c372a9631975bc18c0924a9ce8df0780
  Stored in directory: c:\users\toshiba\appdata\local\pip\cache\wheels\bd\a8\c3\3cf2c14a1837a4e04bd98631724e81f33f462d86a1d895fae0
Successfully built wget
Installing collected packages: wget
Successfully installed wget-3.2

In [28]:
# !wget https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv
# df_students = pd.read_csv('grades.csv',delimiter=',',header='infer')
# df_students.head()

In [30]:
df_students = pd.read_csv('grades.csv',delimiter=',',header='infer')
df_students.head()

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

The DataFrame's read_csv method is used to load data from text files. As you can see in the example code, you can specify options such as the column delimiter and which row (if any) contains column headers (in this case, the delimiter is a comma and the first row contains the column names - these are the default settings, so the parameters could have been omitted).

### Handling missing values

One of the most common issues data scientists need to deal with is incomplete or missing data. So how would we know that the DataFrame contains missing values? You can use the isnull method to identify which individual values are null, like this:

In [31]:
df_students.isnull()

     Name  StudyHours  Grade
0   False       False  False
1   False       False  False
2   False       False  False
3   False       False  False
4   False       False  False
5   False       False  False
6   False       False  False
7   False       False  False
8   False       False  False
9   False       False  False
10  False       False  False
11  False       False  False
12  False       False  False
13  False       False  False
14  False       False  False
15  False       False  False
16  False       False  False
17  False       False  False
18  False       False  False
19  False       False  False
20  False       False  False
21  False       False  False
22  False       False   True
23  False        True   True

Of course, with a larger DataFrame, it would be inefficient to review all of the rows and columns individually; so we can get the sum of missing values for each column, like this:

In [32]:
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

So now we know that there's one missing StudyHours value, and two missing Grade values.

To see them in context, we can filter the dataframe to include only rows where any of the columns (axis 1 of the DataFrame) are null.

In [33]:
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill         8.0    NaN
23   Ted         NaN    NaN

When the DataFrame is retrieved, the missing numeric values show up as NaN (not a number).

So now that we've found the null values, what can we do about them?

One common approach is to impute replacement values. For example, if the number of study hours is missing, we could just assume that the student studied for an average amount of time and replace the missing value with the mean study hours. To do this, we can use the fillna method, like this:

In [34]:
df_students.StudyHours = df_students.StudyHours.fillna(df_students.StudyHours.mean())
df_students

         Name  StudyHours  Grade
0         Dan   10.000000   50.0
1       Joann   11.500000   50.0
2       Pedro    9.000000   47.0
3       Rosie   16.000000   97.0
4       Ethan    9.250000   49.0
5       Vicky    1.000000    3.0
6    Frederic   11.500000   53.0
7      Jimmie    9.000000   42.0
8      Rhonda    8.500000   26.0
9    Giovanni   14.500000   74.0
10  Francesca   15.500000   82.0
11      Rajab   13.750000   62.0
12    Naiyana    9.000000   37.0
13       Kian    8.000000   15.0
14      Jenny   15.500000   70.0
15     Jakeem    8.000000   27.0
16     Helena    9.000000   36.0
17      Ismat    6.000000   35.0
18      Anila   10.000000   48.0
19       Skye   12.000000   52.0
20     Daniel   12.500000   63.0
21      Aisha   12.000000   64.0
22       Bill    8.000000    NaN
23        Ted   10.413043    NaN

Alternatively, it might be important to ensure that you only use data you know to be absolutely correct; so you can drop rows or columns that contains null values by using the dropna method. In this case, we'll remove rows (axis 0 of the DataFrame) where any of the columns contain null values.

In [35]:
df_students = df_students.dropna(axis=0, how='any')
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

### Explore data in the DataFrame

Now that we've cleaned up the missing values, we're ready to explore the data in the DataFrame. Let's start by comparing the mean study hours and grades.

In [36]:
# Get the mean study hours using to column name as an index
mean_study = df_students['StudyHours'].mean()

# Get the mean grade using the column name as a property (just to make the point!)
mean_grade = df_students.Grade.mean()

# Print the mean study hours and mean grade
print('Average weekly study hours: {:.2f}\nAverage grade: {:.2f}'.format(mean_study, mean_grade))

Average weekly study hours: 10.52
Average grade: 49.18

OK, let's filter the DataFrame to find only the students who studied for more than the average amount of time.

In [37]:
# Get students who studied for the mean or more hours
df_students[df_students.StudyHours > mean_study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Note that the filtered result is itself a DataFrame, so you can work with its columns just like any other DataFrame.

For example, let's find the average grade for students who undertook more than the average amount of study time.

In [38]:
# What was their mean grade?
df_students[df_students.StudyHours > mean_study].Grade.mean()

66.7

Let's assume that the passing grade for the course is 60.

We can use that information to add a new column to the DataFrame, indicating whether or not each student passed.

First, we'll create a Pandas Series containing the pass/fail indicator (True or False), and then we'll concatenate that series as a new column (axis 1) in the DataFrame.

In [39]:
passes  = pd.Series(df_students['Grade'] >= 60)
df_students = pd.concat([df_students, passes.rename("Pass")], axis=1)

df_students

         Name  StudyHours  Grade   Pass
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
2       Pedro        9.00   47.0  False
3       Rosie       16.00   97.0   True
4       Ethan        9.25   49.0  False
5       Vicky        1.00    3.0  False
6    Frederic       11.50   53.0  False
7      Jimmie        9.00   42.0  False
8      Rhonda        8.50   26.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
12    Naiyana        9.00   37.0  False
13       Kian        8.00   15.0  False
14      Jenny       15.50   70.0   True
15     Jakeem        8.00   27.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
18      Anila       10.00   48.0  False
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True

DataFrames are designed for tabular data, and you can use them to perform many of the kinds of data analytics operation you can do in a relational database; such as grouping and aggregating tables of data.

For example, you can use the groupby method to group the student data into groups based on the Pass column you added previously, and count the number of names in each group - in other words, you can determine how many students passed and failed.

In [40]:
print(df_students.groupby(df_students.Pass).Name.count())

Pass
False    15
True      7
Name: Name, dtype: int64

You can aggregate multiple fields in a group using any available aggregation function. For example, you can find the mean study time and grade for the groups of students who passed and failed the course.

In [41]:
print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

       StudyHours      Grade
Pass
False    8.783333  38.000000
True    14.250000  73.142857

C:\Users\Toshiba\AppData\Local\Temp/ipykernel_6584/2502225861.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

DataFrames are amazingly versatile, and make it easy to manipulate data. Many DataFrame operations return a new copy of the DataFrame; so if you want to modify a DataFrame but keep the existing variable, you need to assign the result of the operation to the existing variable. For example, the following code sorts the student data into descending order of Grade, and assigns the resulting sorted DataFrame to the original df_students variable.

In [42]:
# Create a DataFrame with the data sorted by Grade (descending)
df_students = df_students.sort_values('Grade', ascending=False)

# Show the DataFrame
df_students

         Name  StudyHours  Grade   Pass
3       Rosie       16.00   97.0   True
10  Francesca       15.50   82.0   True
9    Giovanni       14.50   74.0   True
14      Jenny       15.50   70.0   True
21      Aisha       12.00   64.0   True
20     Daniel       12.50   63.0   True
11      Rajab       13.75   62.0   True
6    Frederic       11.50   53.0  False
19       Skye       12.00   52.0  False
1       Joann       11.50   50.0  False
0         Dan       10.00   50.0  False
4       Ethan        9.25   49.0  False
18      Anila       10.00   48.0  False
2       Pedro        9.00   47.0  False
7      Jimmie        9.00   42.0  False
12    Naiyana        9.00   37.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
15     Jakeem        8.00   27.0  False
8      Rhonda        8.50   26.0  False
13       Kian        8.00   15.0  False
5       Vicky        1.00    3.0  False

### Summary

That's it for now!

Numpy and DataFrames are the workhorses of data science in Python. They provide us ways to load, explore, and analyze tabular data. As we will see in subsequent modules, even advanced analysis methods typically rely on Numpy and Pandas for these important roles.

In our next workbook, we'll take a look at how create graphs and explore your data in more interesting ways.